
4.2
## Navigating Jupyter
## Creating Notebooks in Jupyter

In [82]:
print(2*4)

8

In [83]:
# play around with pandas

In [84]:
import pandas as pd

data=pd.read_csv("datas/nba.csv") 
  
# creating series 
# series = data["Team"] 
  
# returning top n rows 
head = data.head(n = 2) 
tail = data.tail(n=2)

In [85]:
head

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0

In [86]:
tail

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## Python Libraries
Before using a new library for the first time in jupyter notebook, you need to install it via terminal.
e.g. `conda install pandas`

## Importing Libraries
After installing the required library above, import it into juptyter notebook to use it in codes
e.g. `import pandas` or `import pandas as pd`

import pandas
import os
import numpy
# import keras

print('abc' + "cdf")
print(2+6)
abc=9
cdf=8
xyx="ahgyhjjnjjn"
p="rt"
print(abc + cdf)
print(xyx + p)

m="90" # convert to int
num = int(m)
n=10
print(num + n)
Mania=False
print(Mania)

In [89]:
dr=1.56
g=9
pb="789"
b=True
print(type(dr))
print(type(g))
print(type(pb))
print(type(b))
print(type(666666))
print(type("666666"))
print(type(int("66666")))

<class 'float'>
<class 'int'>
<class 'str'>
<class 'bool'>
<class 'int'>
<class 'str'>
<class 'int'>

# Procedures with Data Types
procedures are actions you can perform on any data type.
e.g adding, subtracting, printing, converting, etc

In [109]:
a = 'Hello,'
b = 'Marley'
print(a + b)
d=0
d

Hello,Marley

0

In [115]:
f=9
i=90
print(f>=i)

False